app/controllers/users_controller.rb

  def edit
    @user = User.find(session[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "phone_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "password_digest" = $1, "phone_number" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["password_digest", "$2a$10$jrFBIYUq1yg8pgcHnVcCY.i8GaFpxpfTYpap2JIZQVemMEwObEroG"], ["phone_number", "9253246532"], ["updated_at", "2015-09-18 21:21:25.087316"], ["id", 2]]

    def set_user

        if (session[:id].to_i == params[:id].to_i)
          @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]